package B_Операции.AssignmentOperation_ОперацияПрисваивания;

public class AssignmentOperation_ОперацияПрисваивания {
    public static void main(String[] args) {

        // Присваивание значения переменной:
        System.out.println("Присваивание значения переменной:");
        int x = 10; // Присвоить переменной x значение 10
        String текст = "Привет, мир!"; // Присвоить переменной текст строковое значение

        // Присваивание значения элементу массива:
        System.out.println("Присваивание значения элементу массива:");
        int[] массив = new int[5];
        массив[0] = 1; // Присвоить первому элементу массива значение 1
        массив[1] = 2; // Присвоить второму элементу массива значение 2

        // Присваивание результатов вычислений:
        System.out.println("Присваивание результатов вычислений:");
        int a = 5;
        int b = 3;
        // Присвоить переменной сумма результат сложения a и b (сумма будет равна 8)
        int сумма = a + b;

    }
}
