package N_ВыраженияSwitchЗаписиИПрочиеНедавноДобавленныеСредства.B_ТекстовыеБлоки.C_ИспользованиеДвойныхКавычекВТекстовомБлоке;

public class Example {
    public static void main(String[] args) {
        String str = """
        Внутри текстового блока можно указывать двойные кавычки без необходимости
        в использовании управляющих последовательностей . Например:
        Он сказал: "На крыше кот" .
                Она спросила: "Как он туда попал?"
        """;
        System. out.println(str);
            }
        }
