package F_ПакетыИИнтерфейсы.StandardInterfaceMethods_СтандартныеМетодыИнтерфейса.DefaultMethod;
// Реализовать интерфейс MyIF
public class MyIFImp1 implements MyIF {
    public int getNumber() {
        System.out.print("Объект типа int возвращает: ");
        return 0;
    }
}
