package B_Операции.RelationshipOperations_ОперацииОтношения;

public class RelationshipOperations_ОперацииОтношения {
    public static void main(String[] args) {
        int a = 2;
        int b = 3;
        // Оператор "==" (равно):
        System.out.println("Оператор \"==\" (равно):");
        // Проверяет, равны ли два операнда.
        System.out.println(a == b);

        // Оператор "!=" (не равно):
        System.out.println("Оператор \"!=\" (не равно):");
        // Проверяет, не равны ли два операнда.
        System.out.println(a != b);

        // Оператор ">" (больше):
        System.out.println("Оператор \">\" (больше):");
        // Проверяет, является ли левый операнд больше правого.
        System.out.println(a > b);

        // Оператор "<" (меньше):
        System.out.println("Оператор \"<\" (меньше):");
        // Проверяет, является ли левый операнд меньше правого.
        System.out.println(a < b);

        // Оператор ">=" (больше или равно):
        System.out.println("Оператор \">=\" (больше или равно):");
        // Проверяет, является ли левый операнд больше или равным правому.
        System.out.println(a >= b);

        // Оператор "<=" (меньше или равно):
        System.out.println("Оператор \"<=\" (меньше или равно):");
        // Проверяет, является ли левый операнд меньше или равным правому.
        System.out.println(a <= b);
    }
}
