package N_ВыраженияSwitchЗаписиИПрочиеНедавноДобавленныеСредства.B_ТекстовыеБлоки.B_ВедущиеПробельныеСимволы;

public class Example {
    public static void main(String[] args) {
        String str = """
        Текстовые блоки поддерживают строки, которые
            распростран яются на две и большее количество
                строчек и предохраняют отступы . Они позволяют
            менее утомительно вводить длинные или сложные
        строки в программе .
        """;
        System.out.println(str) ;
            }
        }
